In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame

In [6]:
drame = DataFrame(np.arange(12).reshape(3,4),
                  index = ['BTM','DAMAK','BIRATNAGAR'],
                  columns =['A','B','C','E'])

In [8]:
drame

            A  B   C   E
BTM         0  1   2   3
DAMAK       4  5   6   7
BIRATNAGAR  8  9  10  11

In [10]:
drame.index = drame.index.map(str.lower)

In [11]:
drame

            A  B   C   E
btm         0  1   2   3
damak       4  5   6   7
biratnagar  8  9  10  11

In [12]:
drame.rename(index=str.title, columns=str.lower)# title capitilized the first letter

            a  b   c   e
Btm         0  1   2   3
Damak       4  5   6   7
Biratnagar  8  9  10  11

In [17]:
drame.rename(index={'btm':'new York'},
            columns ={'A':'Alpha'})

            Alpha  B   C   E
new York        0  1   2   3
damak           4  5   6   7
biratnagar      8  9  10  11

In [19]:
drame

            A  B   C   E
btm         0  1   2   3
damak       4  5   6   7
biratnagar  8  9  10  11

In [20]:
drame.rename(index={'btm':'New york'},inplace=True)

In [21]:
drame

            A  B   C   E
New york    0  1   2   3
damak       4  5   6   7
biratnagar  8  9  10  11